stress/post-mid-traffic.yml
config:
  target: 'http://0.0.0.0:3000'
  phases:
    - duration: 10
      arrivalRate: 5
    - pause: 10
    - duration: 10
      arrivalRate: 5
    - pause: 10
    - duration: 10
      arrivalRate: 5
    - pause: 10
    - duration: 10
      arrivalRate: 5
    - pause: 10

scenarios:
  - name: 'ping'
    flow:
      - post:
          url: '/v1/measurements'
          json:
            type: 'ping'
            target: 'google.com'
            locations: []
            limit: 1
          capture:
            json: '$'
            as: 'response'
      - log: '{{ response }}'
  - name: 'http'
    flow:
      - post:
          url: '/v1/measurements'
          json:
            type: 'http'
            target: 'google.com'
            locations: []
            limit: 1
          capture:
            json: '$'
            as: 'response'
      - log: '{{ response }}'
  - name: 'mtr'
    flow:
      - post:
          url: '/v1/measurements'
          json:
            type: 'mtr'
            target: 'google.com'
            locations: []
            limit: 1
          capture:
            json: '$'
            as: 'response'
      - log: '{{ response }}'
  - name: 'dns'
    flow:
      - post:
          url: '/v1/measurements'
          json:
            type: 'dns'
            target: 'google.com'
            locations: []
            limit: 1
          capture:
            json: '$'
            as: 'response'
      - log: '{{ response }}'
  - name: 'traceroute'
    flow:
      - post:
          url: '/v1/measurements'
          json:
            type: 'traceroute'
            target: 'google.com'
            locations: []
            limit: 1
          capture:
            json: '$'
            as: 'response'
      - log: '{{ response }}'